Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70J21B.PIC
      <edc:SFRDef edc:_addr="0x40004014" edc:access="nnnn---n-nnnnnnn----nnnnn-nnnnnn" edc:cname="SSC_RFMR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATLEN" edc:desc="Data Length" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="LOOP" edc:desc="Loop Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MSBF" edc:desc="Most Significant Bit First" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATNB" edc:desc="Data Number per Frame" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FSLEN" edc:desc="Receive Frame Sync Length" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FSOS" edc:desc="Receive Frame Sync Output Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None, RF pin is an input" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="NEGATIVE" edc:desc="Negative Pulse, RF pin is an output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="POSITIVE" edc:desc="Positive Pulse, RF pin is an output" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Driven Low during data transfer, RF pin is an output" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Driven High during data transfer, RF pin is an output" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLING" edc:desc="Toggling at each start of data transfer, RF pin is an output" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEDGE" edc:desc="Frame Sync Edge Detection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="POSITIVE" edc:desc="Positive Edge Detection" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NEGATIVE" edc:desc="Negative Edge Detection" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FSLEN_EXT" edc:desc="FSLEN Field Extension" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004018" edc:access="nnnnnnnnnnnnnnnn----nnnnnnnnnnnn" edc:cname="SSC_TCMR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CKS" edc:desc="Transmit Clock Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Divided Clock" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RK" edc:desc="RK Clock signal" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TK" edc:desc="TK pin" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CKO" edc:desc="Transmit Clock Output Mode Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None, TK pin is an input" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous Transmit Clock, TK pin is an output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TRANSFER" edc:desc="Transmit Clock only during data transfers, TK pin is an output" edc:when="(field &amp; 0x7) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CKI" edc:desc="Transmit Clock Inversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKG" edc:desc="Transmit Clock Gating Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="None" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="EN_TF_LOW" edc:desc="Transmit Clock enabled only if TF Low" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EN_TF_HIGH" edc:desc="Transmit Clock enabled only if TF High" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="START" edc:desc="Transmit Start Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous, as soon as a word is written in the SSC_THR (if Transmit is enabled), and immediately after the end of transfer of the previous data" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RECEIVE" edc:desc="Receive start" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TF_LOW" edc:desc="Detection of a low level on TF signal" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TF_HIGH" edc:desc="Detection of a high level on TF signal" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="TF_FALLING" edc:desc="Detection of a falling edge on TF signal" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="TF_RISING" edc:desc="Detection of a rising edge on TF signal" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TF_LEVEL" edc:desc="Detection of any level change on TF signal" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="TF_EDGE" edc:desc="Detection of any edge on TF signal" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="STTDLY" edc:desc="Transmit Start Delay" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PERIOD" edc:desc="Transmit Period Divider Selection" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000401C" edc:access="nnnn---nnnnnnnnn----nnnnn-nnnnnn" edc:cname="SSC_TFMR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATLEN" edc:desc="Data Length" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="DATDEF" edc:desc="Data Default Value" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MSBF" edc:desc="Most Significant Bit First" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATNB" edc:desc="Data Number per Frame" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FSLEN" edc:desc="Transmit Frame Sync Length" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FSOS" edc:desc="Transmit Frame Sync Output Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None, TF pin is an input" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="NEGATIVE" edc:desc="Negative Pulse, TF pin is an output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="POSITIVE" edc:desc="Positive Pulse, TF pin is an output" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Driven Low during data transfer" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Driven High during data transfer" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLING" edc:desc="Toggling at each start of data transfer" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FSDEN" edc:desc="Frame Sync Data Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEDGE" edc:desc="Frame Sync Edge Detection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="POSITIVE" edc:desc="Positive Edge Detection" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NEGATIVE" edc:desc="Negative Edge Detection" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FSLEN_EXT" edc:desc="FSLEN Field Extension" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004020" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="SSC_RHR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RDAT" edc:desc="Receive Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
